CREATE DATABASE  IF NOT EXISTS `shop` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `shop`;
-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: shop
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `article` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '主键，自增长的文章编号',
  `article_id` varchar(50) NOT NULL COMMENT '文章的唯一标识符',
  `user_id` varchar(50) DEFAULT NULL COMMENT '发布文章的用户 ID',
  `user_name` varchar(50) DEFAULT NULL COMMENT '发布文章的用户昵称',
  `user_image` varchar(200) DEFAULT NULL COMMENT '发布文章的用户头像链接',
  `article_type` varchar(10) DEFAULT NULL COMMENT '0 学习，1是生活，2是其他',
  `article_content` text COMMENT '文章的内容',
  `article_image` text COMMENT '文章中包含的图片链接',
  `article_video` text COMMENT '文章中包含的视频链接',
  `views_count` int DEFAULT '0' COMMENT '文章的转发数',
  `comment_count` int DEFAULT '0' COMMENT '文章的评论数',
  `like_count` int DEFAULT '0' COMMENT '文章的点赞数',
  `create_time` datetime DEFAULT NULL COMMENT '文章的创建时间',
  `source` varchar(100) DEFAULT NULL COMMENT '文章的来源，例如：Android 客户端、iPhone 客户端、网页版等',
  `location` varchar(100) DEFAULT NULL COMMENT '发布文章的地理位置',
  `topic` varchar(100) DEFAULT NULL COMMENT '文章的话题标签',
  `category` int COMMENT '文章是类型',
  `is_long` tinyint(1) DEFAULT '0' COMMENT '文章是否为长微博，1 表示是，0 表示否',
  `attitude` varchar(10) DEFAULT NULL COMMENT '用户对文章的态度，例如：赞、踩、中立等',
  `status` int DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `article_id` (`article_id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户文章表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (1,'A001','admin','爱糖宝','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','1','天气真好，出去赏花了！这是一个非常美妙的时刻，一个可以让心情变得愉悦和舒畅的时刻。在这样的日子里，我们总想找一个舒适的地方，去感受大自然的美好，去品味万物生长的神奇和力量。\r\n\r\n出门赏花，是一个非常好的选择。花儿是大自然的艺术品，它们以它们的美丽和色彩，让我们感到愉悦和惊叹。在这个季节里，各种各样的花儿都在盛开，它们的芳香和色彩，将整个世界染上了一片美好。\r\n\r\n在赏花的过程中，我们可以感受到花儿的生命力和美丽，也可以感受到大自然的奇妙和神秘。我们可以静静地坐在花丛中，欣赏花儿的绽放，感受花香的气息，听着鸟儿的歌声，享受这份与自然和谐共处的美好时光。\r\n\r\n出门赏花，也是一个放松和愉悦的过程。在花的世界里，我们可以暂时抛开烦恼和压力，享受这份与大自然相处的平静和宁静。我们可以找到内心的平衡和安宁，也可以找到生命的意义和价值。\r\n\r\n在这个美好的季节里，出门赏花，是一个非常好的选择。让我们抽出时间，去赏花、去感受自然的美好，去找到内心的平静和宁静。让我们在大自然中感受生命的奇妙和力量，让我们与大自然和谐共处，享受这份美好和宁静。',NULL,NULL,10,20,50,'2023-05-08 12:01:32','网页版','北京','天气真好,出去赏花了!',6,0,'赞',0),(2,'A002','1589680953404254146','种鱼的猫猫','/images/pic/2d885a22918841c99c685379f0f4ce41.jpg','1','Further Yours是一个极具创新性的学习平台，提供了多种学习资源和服务，以帮助学员不断提升自己的技能和知识。Further Yours的口号是“保证齐全，学这补这！让你的生活更精彩，你的人生更丰富。营养均衡才是关键，每天的你都很重要。”\r\n\r\n保证齐全是Further Yours最大的优势之一。在这个平台上，学员可以找到各种各样的学习资源，包括课程、教材、练习题、项目等等。无论你是初学者还是有经验的专业人士，都能找到适合自己的学习内容和方式。这样的保证齐全，为学员提供了更多的选择和机会，让他们能够更好地发挥自己的潜力和能力。\r\n\r\n学这补这是Further Yours的另一个特色。在这个平台上，学员可以根据自己的需求和兴趣，选择不同的课程和项目进行学习和实践。无论是想学习编程、设计、营销、管理等各种领域的知识，还是想掌握一门新的技能或者补充自己的专业知识，都可以在Further Yours找到适合自己的学习内容和方式。这样的学这补这，让学员能够更加全面、系统地提升自己的技能和知识，更好地适应职场和社会的变化和挑战。\r\n\r\n让生活更精彩，让人生更丰富，是Further Yours最终的目标。在这个平台上，学员不仅可以获得专业技能和知识，还可以结识同行和专家，交流和分享经验和见解。通过学习和实践，学员可以不断提升自己的能力和自信心，实现自己的理想和目标。这样的让生活更精彩，让人生更丰富，让学员能够拥有更加充实和有意义的人生。\r\n\r\n营养均衡才是关键，每天的你都很重要。在Further Yours学习，不仅需要掌握专业知识和技能，还需要注意保持健康和平衡的生活方式。只有身体健康和精神平衡，才能更好地投入学习和工作，实现自己的梦想和目标。因此，Further Yours也提供了多种健康和生活方面的课程和资源，帮助学员保持健康和平衡的生活方式。\r\n\r\n总之，Further Yours是一个极具创新性和实用性的学习平台，为学员提供了多种学习资源和服务，帮助他们不断提升自己的技能和知识，让生活更精彩，人生更丰富。无论你是初学者还是专业人士，无论你的目标和兴趣是什么，都可以在这个平台上找到适合自己的学习内容和方式。',NULL,NULL,46,10,20,'2023-05-08 23:01:34','网页版','上海','Further yours保证齐全,学这补这!让你的生活更精彩,你的人生更丰富。营养均衡才是关键,每天的你都很重要。',5,0,'中立',0),(3,'A003','admin','爱糖宝','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','0','在人与人之间，无论是情感上还是理念上，总会存在不同的看法和思想。有时候，我们可以一起分享面包和水，但是无法分享心灵深处的东西，有时候我们会觉得自己被孤立在一个世界中，没有人能够真正理解自己的内心。\r\n\r\n或许，这就是生命的一部分。我们每个人都有自己的世界和梦想，但是并不是所有人都能够理解和分享。我们需要学会接受这一点，并且在寻找理解的过程中，也要学会尊重和包容不同的观点和想法。\r\n\r\n相交的两条线只有一点重合，但是也正是因为这一点，才有了不同的交集和可能性。我们或许无法完全理解和分享对方的世界和梦想，但是我们可以尝试用心去倾听和理解，去寻找共同点和交集，去接受和包容不同的思想和观点。这样，或许我们就能够在生命的旅程中找到更多的可能性和意义。\r\n\r\n让我们一起用心去感受和理解这个世界，去探索和追寻自己的梦想和目标，让自己的生命变得更加丰富和有意义。',NULL,NULL,5,5,10,'2023-05-08 12:01:34','网页版','广州','你的面包我吃了,你的水我喝了,但是我的世界你不懂,我的梦想你不在乎。我们就像两条相交的线,只有一点相交,其余永不相交。',4,0,'踩',0),(4,'A004','1589644044287166342','初雪','/images/pic/2d885a22918841c99c685379f0f4ce41.jpg','1','黄昏时分，一个人独自在海边漫步。海面上朦胧的夕阳在不远处慢慢下沉，天边染上了一抹温柔的粉红色，映照在海面上，让人感觉仿佛身处于一个梦幻般的世界中。\r\n\r\n海鸟在天空中翱翔，似乎是在为这个美好的夜晚增添一份生命的活力。微风吹拂着脸庞，海浪轻轻拍打着海岸，发出悦耳的声响，一切都是那么的安详与惬意。\r\n\r\n这个人静静地走着，感受着周围的一切，享受着这份与自然和谐共处的美好时光。他不再感到孤独，也不再感到无助，因为在这个时刻，他与海、与天、与鸟、与风、与阳光都融为了一体，成为了这个世界上无数美好元素中的一份子。\r\n\r\n这是一个纯净而美好的时刻，这个人深深地感受到了自己与自然和谐共存的意义和价值。他明白了，有时候，人们需要远离城市的喧嚣和繁忙，去寻找一份与大自然相处的平静与宁静，去感受那些不需要语言的美好，去寻找内心的平衡与安宁。\r\n\r\n当夜幕降临，这个人依然在海边徘徊，沉浸在这份美好与宁静之中。他知道，这个夜晚将会成为他生命中的一段难忘回忆，也将会成为他对于自然与生命的一份感悟和领悟。\r\n\r\n在这个美好的夜晚里，这个人找到了内心的平静与宁静，也找到了与自然和谐共处的意义和价值。或许，这就是生命的意义之一，去探索和发现那些让我们内心平静和感到幸福的美好与存在。',NULL,NULL,1,1,5,'2023-05-08 12:01:35','网页版','厦门','黄昏,一个人在海边散步,海面上朦胧的夕阳在不远处慢慢下沉,天边染上粉红色,海鸟在天空翱翔,一切都是那么的安详与惬意。',6,1,'赞',0),(5,'A005','admin','爱糖宝','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','1','一个人安静地喝杯咖啡，听听音乐，看看人来人往，也是一种享受。在这个忙碌的时代，我们总是被各种琐事和压力所包围，很少有机会停下来，用心去感受周围的一切。但是，偶尔放慢脚步，给自己一点小碎片的时间，其实也蛮好。\r\n\r\n在这样的时刻里，我们可以将注意力放在自己身上，感受内心的平静和宁静。喝一杯咖啡，听一首音乐，看看周围的人来人往，这些都可以让我们暂时抛开快节奏的生活，享受一份与自己相处的平静和宁静。\r\n\r\n喝咖啡，是一种让人心情愉悦的享受。咖啡的香气和味道，可以让我们感受到一份温暖和舒适，也可以让我们感受到生命的美好和丰富。在喝咖啡的过程中，我们可以思考自己的生活和目标，也可以放松自己的身心，享受这份与自己相处的美好时光。\r\n\r\n听音乐，是一种可以让人心情愉悦和放松的享受。音乐的节奏和旋律，可以让我们感受到一份节奏和和谐，也可以让我们感受到生命的多彩和美好。在听音乐的过程中，我们可以放松自己的身心，享受这份与音乐相处的美好时光。\r\n\r\n看人来人往，也是一种可以让人感受到生命的美好和多彩的享受。在人群中，我们可以看到各种各样的人物和故事，感受到生命的丰富和多彩。在看人来人往的过程中，我们可以放松自己的身心，享受这份与周围人物相处的美好时光。\r\n\r\n在这个忙碌的生活中，偶尔放慢脚步，给自己一点小碎片的时间，其实也蛮好。让我们抽出时间，喝一杯咖啡，听一首音乐，看看周围的人来人往，享受这份与自己和周围环境相处的美好时光。让我们在快节奏的生活中，找到内心的平静和宁静，让生命变得更加美好和丰富。',NULL,NULL,25,2,8,'2023-05-08 19:01:35','网页版','武汉','一个人安静地喝杯咖啡,听听音乐,看看人来人往,也是一种享受。忙碌的生活里偶尔放慢脚步,给自己一点小碎片的时间,其实也蛮好。',5,0,'赞',0),(6,'A006','1577713712942250291','小雨点','/images/pic/xz_1582081544527.png','1','','/images/article/p1.jpg#/images/article/p2.jpg',NULL,3,2,8,'2023-05-08 12:01:35','网页版','武汉','日常打卡',5,0,'赞',0),(7,'A007','1589644044287166342','初雪','/images/pic/2d885a22918841c99c685379f0f4ce41.jpg','1','软件编程是一个不断发展和变化的领域，学习软件编程需要不断地更新知识和技能。在学习软件编程时，选择一种合适的学习方式对于提高学习效率和质量非常重要。\r\n\r\n首先，自学是一种常见的学习方式。自学软件编程需要具备一定的自觉性和自律性，通过阅读书籍、教程和在线资源等，进行学习和练习。自学可以让学习者自由安排时间和学习进度，但是需要注意避免盲目学习和缺乏反馈的问题。\r\n\r\n其次，参加培训班或者课程也是一种常见的学习方式。通过参加专业的培训班或者课程，可以获得系统化的知识和指导，同时也可以与其他学习者交流和分享经验。但是需要注意选择合适的培训班或者课程，并且需要投入一定的时间和精力。\r\n\r\n另外，参与开源项目和社区也是一种非常有价值的学习方式。通过参与开源项目和社区，可以与其他开发者交流和合作，学习到最新的技术和实践方法。同时，也可以通过贡献代码和解决问题，提高自己的编程能力和经验。\r\n\r\n无论采取哪种学习方式，都需要注意以下几点：\r\n\r\n建立良好的学习计划和目标。制定具体、可行的学习计划和目标，并在学习过程中不断调整和完善。\r\n\r\n不断练习和实践。软件编程是一种实践性很强的学科，需要不断练习和实践，才能获得真正的技能和经验。\r\n\r\n掌握基础知识和技能。在学习软件编程的过程中，需要掌握基础的编程语言、数据结构、算法等知识和技能，才能在实际开发中应用。\r\n\r\n学会有效的沟通和合作。软件编程是一种团队性很强的工作，需要学会与其他开发者、用户和管理人员进行有效的沟通和合作。\r\n\r\n总之，学习软件编程需要选择适合自己的学习方式，并且不断更新知识和技能。只有不断实践和努力，才能成为一名优秀的软件开发者。',NULL,NULL,9,1,5,'2023-05-09 01:01:35','网页版','厦门','软件编程学习方式',5,1,'赞',0),(8,'1684675266255732202','1589628308220845788','紫殇~',NULL,'0','<p>啊啊啊</p>','',NULL,2,0,0,'2023-05-08 12:01:34',NULL,NULL,'事实上',3,0,NULL,0);
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chatmsg`
--

DROP TABLE IF EXISTS `chatmsg`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chatmsg` (
  `senduserid` varchar(64) DEFAULT NULL COMMENT '发送者id',
  `reciveuserid` varchar(64) DEFAULT NULL COMMENT '接收者id',
  `content` text COMMENT '发送内容',
  `sendtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '发送时间',
  `msgtype` varchar(64) DEFAULT NULL COMMENT '消息类型'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chatmsg`
--

LOCK TABLES `chatmsg` WRITE;
/*!40000 ALTER TABLE `chatmsg` DISABLE KEYS */;
INSERT INTO `chatmsg` VALUES ('1577713712942250291','1582184795951594874','你好','2020-04-18 10:07:49','0'),('1582184795951594874','1577713712942250291','有人吗','2020-04-26 07:43:47','0'),('1577713712942250291','1582184795951594874','你好','2020-04-26 07:46:51','0'),('1582184795951594874','1577713712942250291','商品怎么卖','2020-04-26 07:47:42','0'),('1577713712942250291','1582184795951594874','便宜点','2020-04-26 07:47:56','0'),('1577713712942250291','1582184795951594874','你好，想问你一些问题可以吗？','2020-05-17 06:09:30','0'),('1582184795951594874','1577713712942250291','什么事','2020-05-17 06:11:19','0'),('1577713712942250291','1582184795951594874','商品现在怎么样','2020-05-17 06:11:41','0'),('1582184795951594874','1577713712942250291','111','2021-02-25 02:58:00','0'),('1577713712942250291','1582184795951594874','2222','2021-02-25 02:58:09','0'),('1577713712942250291','1582184795951594874','1111','2021-02-25 02:58:41','0'),('1582184795951594874','1577713712942250291','222','2021-02-25 02:58:43','0'),('1577713712942250291','1582184795951594874','222','2021-02-25 02:58:46','0'),('1582184795951594874','1577713712942250291','222','2021-02-25 02:58:49','0'),('1582184795951594874','1577713712942250291','111','2021-02-25 02:58:52','0'),('1577713712942250291','1582184795951594874','2222','2021-02-25 02:58:53','0'),('1577713712942250291','1587889073148226284','1111','2021-02-25 03:51:58','0'),('1587889073148226284','1577713712942250291','2222','2021-02-25 03:52:04','0'),('1587889073148226284','1577713712942250291','111','2021-02-25 03:52:07','0'),('1582184795951594874','1577713712942250291','111','2021-02-25 04:04:47','0'),('1577713712942250291','1582184795951594874','222','2021-02-25 04:05:01','0'),('1582184795951594874','1577713712942250291','111','2021-02-25 04:05:03','0'),('1577713712942250291','1582184795951594874','111','2021-03-08 04:33:20','0'),('1582184795951594874','1577713712942250291','22121','2021-03-08 04:33:30','0'),('1577713712942250291','1582184795951594874','你好','2021-03-08 05:04:23','0'),('1582184795951594874','1577713712942250291','111','2021-03-08 05:04:28','0'),('1582184795951594874','1577713712942250291','你好','2021-03-08 05:19:00','0'),('1582184795951594874','1577713712942250291','11','2021-03-08 05:19:28','0'),('1582184795951594874','1577713712942250291','亲们','2021-03-08 05:19:55','0'),('1577713712942250291','1582184795951594874','你好','2021-03-08 05:20:09','0'),('1582184795951594874','1577713712942250291','123','2021-03-08 05:20:26','0'),('1577713712942250291','1582184795951594874','123','2021-03-08 05:22:50','0'),('1589628308220845788','1577713712942250291','Hi','2023-05-21 08:09:54','0'),('1577713712942250291','1589628308220845788','face[怒] ','2023-05-21 08:10:13','0'),('1589628308220845788','1577713712942250291','face[拜拜] ','2023-05-21 13:36:16','0');
/*!40000 ALTER TABLE `chatmsg` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `collect`
--

DROP TABLE IF EXISTS `collect`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `collect` (
  `id` varchar(64) NOT NULL COMMENT '收藏id',
  `commid` varchar(64) NOT NULL COMMENT '商品id',
  `commname` varchar(255) DEFAULT NULL COMMENT '商品名',
  `commdesc` varchar(255) DEFAULT NULL COMMENT '商品描述',
  `soldtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '收藏时间',
  `collstatus` int DEFAULT '1' COMMENT '0失效 1正常 2删除',
  `cmuserid` varchar(64) NOT NULL COMMENT '商品用户id',
  `username` varchar(255) DEFAULT NULL COMMENT '商品用户名',
  `school` varchar(255) DEFAULT NULL COMMENT '商品所在学校',
  `couserid` varchar(64) NOT NULL COMMENT '收藏用户id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `collect`
--

LOCK TABLES `collect` WRITE;
/*!40000 ALTER TABLE `collect` DISABLE KEYS */;
INSERT INTO `collect` VALUES ('1587114966615640492','1583938997302470599','旅行套装60ml三件套','悦美时刻 INS北欧风化妆品分装瓶旅行套装60ml三件套 软管挤压式乳液瓶 清洁消毒分装瓶 便携空瓶 60ml*3(北欧色三件套）','2020-04-17 09:16:06',1,'1582184795951594874','猫儿','北京大学','1582184795951594874'),('1587871913598887497','1583935356645701706','Python神经网络编程','Python神经网络编程Python神经网络编程Python神经网络编程Python神经网络编程','2020-04-26 03:31:53',1,'1577713712942250291','猫给这儿','清华大学','1582184795951594874'),('1587871944600984372','1583935476800117681','物联网Python开发实战','物联网Python开发实战物联网Python开发实战物联网Python开发实战物联网Python开发实战物联网Python开发实战','2020-04-26 03:32:24',1,'1577713712942250291','猫给这儿','清华大学','1582184795951594874'),('1587872087231252520','1583940546885846474','爱玛电动车 小爱蜜','爱玛电动车 小爱蜜 电动自行车学生代步电瓶车 前后真空胎 带脚踏 加长舒适后减震 3C大证 新国标 奶白咖啡 新国标','2020-04-26 03:34:47',1,'1582184795951594874','猫儿','北京大学','1582184795951594874'),('1587872099399999785','1583937015909416441','中文版3ds Max 2016从入门到精通','中文版3ds Max 2016从入门到精通（全彩印 微课视频版）243集视频讲解171个实例案例3dmax教程','2020-04-26 03:34:59',1,'1582184795951594874','猫儿','清华大学','1582184795951594874'),('1589541027690999055','1583935120549879620','Python全栈开发三剑客 （京东套装共3册）','Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）','2020-05-15 11:10:27',2,'1577713712942250291','猫给这儿','清华大学','1582184795951594874'),('1614221447664520109','1583937153164789685','男士外套春秋2020','花花公子(PLAYBOY) 男士外套春秋2020新款韩版潮流帅气春装棒球服机能休闲夹克 军绿色 XL','2021-02-25 02:50:47',2,'1577713712942250291','猫给这儿','清华大学','1577713712942250291'),('1614221555284867221','1583941398323204767',' 萨伽单木吉他','萨伽SAGA 单板民谣吉他面单木吉他41寸40寸吉它初学者乐器 云杉原木色 SF700C 41寸缺角','2021-02-25 02:52:35',1,'1582184795951594874','猫儿','北京大学','1577713712942250291'),('1615178016456989911','1583940546885846474','爱玛电动车 小爱蜜','爱玛电动车 小爱蜜 电动自行车学生代步电瓶车 前后真空胎 带脚踏 加长舒适后减震 3C大证 新国标 奶白咖啡 新国标','2021-03-08 04:33:36',1,'1582184795951594874','猫儿','北京大学','1577713712942250291'),('1615179809643184421','1583937436355876950','活着','书名：活着 该本书是25周年典藏纪念版 余华小说作品集','2021-03-08 05:03:29',1,'1582184795951594874','猫儿','北京大学','1577713712942250291'),('1615180208107888982','1583937436355876950','活着','书名：活着 该本书是25周年典藏纪念版 余华小说作品集','2021-03-08 05:10:08',2,'1582184795951594874','猫儿','北京大学','1589628308220845788'),('1615180719155778408','1583937609451390776','茶花 漱口杯刷牙杯子','茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列','2021-03-08 05:18:39',1,'1582184795951594874','猫儿','清华大学','1582184795951594874'),('1684653326597555122','1577793367826729923','华为 nova 6 SE','品牌名称：HUAWEI,证书编号：2019011606250738,证书状态：有效产品名称：TD-LTE数字移动电话机3C规格型号：JNY-AL10(开关电源适配器I：HW-100400C01 输出:5VDC 2A或9VDC 2A或...产品名称：HUAWEI nova 6 SE华为型号: Nova 6 SE机身颜色: 幻夜黑 绮境森林 樱雪晴空运行内存RAM: 8GB存储容量: 8+128GB网络模式: 双卡双待CPU型号: HUAWEI Kirin 810（麒麟810）',NULL,1,'1577713712942250291','小雨点','清华大学','1589628308220845788'),('1684674450880899662','1583941398323204767',' 萨伽单木吉他','萨伽SAGA 单板民谣吉他面单木吉他41寸40寸吉它初学者乐器 云杉原木色 SF700C 41寸缺角',NULL,1,'1582184795951594874','小囧姐','北京大学','1589628308220845788');
/*!40000 ALTER TABLE `collect` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `cid` varchar(64) NOT NULL COMMENT '评论id',
  `commid` varchar(64) NOT NULL COMMENT '商品id',
  `cuserid` varchar(64) NOT NULL COMMENT '评论者id',
  `spuserid` varchar(64) DEFAULT NULL COMMENT '商品发布者id',
  `content` varchar(255) DEFAULT NULL COMMENT '评论内容',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '评论时间',
  `commstatus` int DEFAULT '1' COMMENT '0异常 1正常 2删除',
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES ('1','1577792919764240135','1582184795951594874','1577713712942250291','不错啊，东西很好','2020-02-24 14:49:56',1),('1588251204811301252','1583939483587193411','1577713712942250291','1582184795951594874','怎么卖呀？能不能优惠点','2020-04-30 12:53:24',1),('1614226508675446955','1583940546885846474','1577713712942250291','1582184795951594874','111','2021-02-25 04:15:08',1),('1660013536434249729','A005','1589628308220845788',NULL,'aa','2021-02-25 04:15:08',2),('1660014295896875010','A005','1589628308220845788',NULL,'aa','2021-02-25 04:15:08',2),('1660014723095126018','A005','1589628308220845788',NULL,'aa','2021-02-25 04:15:08',2),('1660111431124652033','A001','1589628308220845788',NULL,NULL,'2023-05-21 02:33:03',2),('1660114000660140034','A001','1589628308220845788',NULL,'你好啊','2023-05-21 02:43:16',2),('1660152466873847810','A001','1589628308220845788',NULL,'很棒','2023-05-21 05:16:07',1),('1660167597364097026','A007','1589628308220845788',NULL,'哈哈哈哈','2023-05-21 06:16:14',2),('1660169422444277761','A006','1589628308220845788',NULL,'图片不错','2023-05-21 06:23:29',1),('1660284376430272514','A003','1589628308220845788',NULL,'你好啊','2023-05-21 14:00:17',1);
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `commimages`
--

DROP TABLE IF EXISTS `commimages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `commimages` (
  `id` varchar(64) NOT NULL COMMENT '图片id',
  `commid` varchar(64) DEFAULT NULL COMMENT '商品id',
  `image` varchar(255) DEFAULT NULL COMMENT '图片',
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '上传时间',
  `imagestatus` int DEFAULT '1' COMMENT '1正常 2删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `commimages`
--

LOCK TABLES `commimages` WRITE;
/*!40000 ALTER TABLE `commimages` DISABLE KEYS */;
INSERT INTO `commimages` VALUES ('1577792919780137921','1577792919764240135','/images/pic/d280ac1a7b4a40a1822459a401e83592.jpg','2019-12-31 11:48:39',2),('1577792919780240088','1577792919764240135','/images/pic/3dfe006eb2ea45ddac3b75f98ab72da5.jpg','2019-12-31 11:48:39',2),('1577792919780683065','1577792919764240135','/images/pic/e41c6fda976a47d2bb07d10da6c44453.png','2019-12-31 11:48:39',2),('1577793367842385757','1577793367826729923','/images/pic/c02fcebc7af046fea15484b74e551dec.jpg','2019-12-31 11:56:07',1),('1577793367842401604','1577793367826729923','/images/pic/d434cc733b974a37b2273528fc663e8c.jpg','2019-12-31 11:56:07',1),('1577793367842640909','1577793367826729923','/images/pic/1094e52bc1e04a8bb8df0e443a4b75d4.png','2019-12-31 11:56:07',1),('1583934830636144010','1583934830542354596','/images/pic/e99b0b08b02b4aba9e41517ee567695c.jpg','2020-03-11 13:53:50',1),('1583934830636210213','1583934830542354596','/images/pic/778d6e97081c4a71b1ae213c9f086247.jpg','2020-03-11 13:53:50',1),('1583934830636594282','1583934830542354596','/images/pic/c6bcb4de63ff44d5a9f6641248ad9a1a.jpg','2020-03-11 13:53:50',1),('1583935025024808644','1583935025023726250','/images/pic/e3fcbe45ff3f48008a8a3e47c3b82643.jpg','2020-03-11 13:57:05',1),('1583935025024899621','1583935025023726250','/images/pic/b241245c825d4316b06c592f90fc9a46.jpg','2020-03-11 13:57:05',1),('1583935025024936977','1583935025023726250','/images/pic/290fdebc38a2423bb76b631a1914c1dc.jpg','2020-03-11 13:57:05',1),('1583935120550217426','1583935120549879620','/images/pic/ea2fce86307c4e068e6f7ce0dd03c808.jpg','2020-03-11 13:58:40',1),('1583935120550246338','1583935120549879620','/images/pic/71e558c5e4384f268c5e99b185cac14c.jpg','2020-03-11 13:58:40',1),('1583935120550765609','1583935120549879620','/images/pic/ed81f0896ad54fbd855dccfbfb459942.jpg','2020-03-11 13:58:40',1),('1583935211397724639','1583935211397204485','/images/pic/924af36b3f3d4c8aa45496676b89d38f.jpg','2020-03-11 14:00:11',1),('1583935211397760987','1583935211397204485','/images/pic/977d35f283bd4ea3a3ca3b7a817a6e07.jpg','2020-03-11 14:00:11',1),('1583935211397815726','1583935211397204485','/images/pic/9fe5f2d9cd1d46e6ba3ec52b594a7b59.jpg','2020-03-11 14:00:11',1),('1583935356645851359','1583935356645701706','/images/pic/322917096e004b76b9f3863384bb2178.jpg','2020-03-11 14:02:36',2),('1583935356645865668','1583935356645701706','/images/pic/96347cab08dd48dc8eef7a2b483b0e0f.jpg','2020-03-11 14:02:36',2),('1583935356645954928','1583935356645701706','/images/pic/b5687d8111634fcb9b175bd5045b16cb.jpg','2020-03-11 14:02:36',2),('1583935476800204656','1583935476800117681','/images/pic/1a4ab27599ac45188993de213ee807e3.jpg','2020-03-11 14:04:36',1),('1583935476800318386','1583935476800117681','/images/pic/69e9805ca0d249329943167000c8f473.jpg','2020-03-11 14:04:36',1),('1583935476800838750','1583935476800117681','/images/pic/48ac8f47d5a149f195568dd6b573ff64.jpg','2020-03-11 14:04:36',1),('1583935629593113362','1583935629583927102','/images/pic/96d07cf4e4d444b0810c47288c47e960.jpg','2020-03-11 14:07:09',2),('1583935629593564430','1583935629583927102','/images/pic/60878b86482449629c4186ebe2f753f8.jpg','2020-03-11 14:07:09',2),('1583935629593697605','1583935629583927102','/images/pic/01c5f9ab3f6b42a3ab91698de161861f.jpg','2020-03-11 14:07:09',2),('1583935632551212386','1583935632551786928','/images/pic/33fa6aa1dde343e0a091a1dbdda0eae8.jpg','2020-03-11 14:07:12',2),('1583935632551685390','1583935632551786928','/images/pic/d15743e1cd2949828644e43f0d42766e.jpg','2020-03-11 14:07:12',2),('1583935632551733283','1583935632551786928','/images/pic/cdda2d5cec784b299b2102e1bc462868.jpg','2020-03-11 14:07:12',2),('1583935731016144142','1583935731015473292','/images/pic/35e62ca86c6d41db9dfdd2e8f33067dd.jpg','2020-03-11 14:08:51',1),('1583935731016269985','1583935731015473292','/images/pic/0ef371e1a6e04cc6b9bbdf140a0dff62.jpg','2020-03-11 14:08:51',1),('1583935731016732033','1583935731015473292','/images/pic/a33d4e4b05154367849d0d6cad97e47d.jpg','2020-03-11 14:08:51',1),('1583935867328120780','1583935867326176449','/images/pic/edb291d92c264968a75aa384e3fa758e.jpg','2020-03-11 14:11:07',2),('1583935867328655732','1583935867326176449','/images/pic/fd83441f9b5c45aab8f608535435c7b9.jpg','2020-03-11 14:11:07',2),('1583935867328808428','1583935867326176449','/images/pic/356468fdd2b243158a031d92e37f6b97.jpg','2020-03-11 14:11:07',2),('1583936216831296684','1583936216831713367','/images/pic/21e61ca0d18246fd9ed113f11f466cf3.jpg','2020-03-11 14:16:56',1),('1583936216831303587','1583936216831713367','/images/pic/cb734c7881c4488c9e01efa934a76b1d.jpg','2020-03-11 14:16:56',1),('1583936216831449026','1583936216831713367','/images/pic/4797c9054364475a844aa952bac88b0c.jpg','2020-03-11 14:16:56',1),('1583936883627548170','1583936883626893988','/images/pic/b4f36a3487d34c2aaad116a84a75bba8.jpg','2020-03-11 14:28:03',2),('1583936883627611316','1583936883626893988','/images/pic/a2f48d41f04e48f384fb49b0bf621902.jpg','2020-03-11 14:28:03',2),('1583936883627883286','1583936883626893988','/images/pic/d6f2d6024acc4d6b9e1f3eecd2d9ec79.jpg','2020-03-11 14:28:03',2),('1583937015909346306','1583937015909416441','/images/pic/6f46977a08644168b9f227fdc1e828c9.jpg','2020-03-11 14:30:15',1),('1583937015909387564','1583937015909416441','/images/pic/403898100efa4377aced73754982f573.jpg','2020-03-11 14:30:15',1),('1583937015909785017','1583937015909416441','/images/pic/4b4d157cc2e14363be936094ec38f712.jpg','2020-03-11 14:30:15',1),('1583937021774260802','1583937021773641591','/images/pic/cc37842b3a374446a3a2b2919ccdf0a7.jpg','2020-03-11 14:30:21',2),('1583937021774461572','1583937021773641591','/images/pic/951680b5e22d48eaa0ee9ba589f02aac.jpg','2020-03-11 14:30:21',2),('1583937021774847001','1583937021773641591','/images/pic/81e8f40571ae4ff8bb8630551ec16d7f.jpg','2020-03-11 14:30:21',2),('1583937153164110959','1583937153164789685','/images/pic/fd6b248b52a141b282ffd3ac15b6f812.jpg','2020-03-11 14:32:33',1),('1583937153164318871','1583937153164789685','/images/pic/d223ec95ff624557829905b11018e342.jpg','2020-03-11 14:32:33',1),('1583937153164916622','1583937153164789685','/images/pic/0d85bb98dbcc4e73b701cc49f2d699cd.jpg','2020-03-11 14:32:33',1),('1583937266661251424','1583937266660587070','/images/pic/50d584b0fba844beaf09cf9e71eabb95.jpg','2020-03-11 14:34:26',1),('1583937266661312270','1583937266660587070','/images/pic/a8245a1855ed409bb6709bf14a47d7b8.jpg','2020-03-11 14:34:26',1),('1583937266661525093','1583937266660587070','/images/pic/70fdb719bcdc4b2183aa0d8afd9fa4c7.jpg','2020-03-11 14:34:26',1),('1583937436356108209','1583937436355876950','/images/pic/6fc52536b5e94f71bad000d62c70daaf.jpg','2020-03-11 14:37:16',2),('1583937436356547975','1583937436355876950','/images/pic/9542a9d3e0924ab0b442861efd4f3a19.jpg','2020-03-11 14:37:16',2),('1583937436356707990','1583937436355876950','/images/pic/083b2bdd03ba41258c4925788e7a15db.jpg','2020-03-11 14:37:16',2),('1583937609451158589','1583937609451390776','/images/pic/14f4a556d3af482a866106ad65023b77.jpg','2020-03-11 14:40:09',1),('1583937609451202537','1583937609451390776','/images/pic/85ee5e69f3194d5ba9fa24a5f6532fb4.jpg','2020-03-11 14:40:09',1),('1583937609451477588','1583937609451390776','/images/pic/7e8388638dac4f34a40697b5b3cc1e33.jpg','2020-03-11 14:40:09',1),('1583937754237240150','1583937754237685707','/images/pic/d866bba50abd4a7484d31fac8a2c9cf9.jpg','2020-03-11 14:42:34',2),('1583937754237566158','1583937754237685707','/images/pic/538e7a1aca7d4532a1483752a90ed6bd.jpg','2020-03-11 14:42:34',2),('1583937754237766770','1583937754237685707','/images/pic/d7ca15fd8103486f97804e44e2a3e6d3.jpg','2020-03-11 14:42:34',2),('1583938217414187895','1583938217414801162','/images/pic/44da9c445dbc49bb9d2478efd2872d2f.jpg','2020-03-11 14:50:17',1),('1583938217414671070','1583938217414801162','/images/pic/44371e14c7a34222ad8650ec2e6db75a.jpg','2020-03-11 14:50:17',1),('1583938217414765849','1583938217414801162','/images/pic/ac500b984eb843f3b4f77cb7247480b9.jpg','2020-03-11 14:50:17',1),('1583938501381217032','1583938501381902202','/images/pic/ad7a13296c04400ba001aa6c424776a7.jpg','2020-03-11 14:55:01',1),('1583938501381665785','1583938501381902202','/images/pic/3b041e745f76416bb928de7150b5a951.jpg','2020-03-11 14:55:01',1),('1583938501381874481','1583938501381902202','/images/pic/aa36bc4a7063496f80c2f158a8a1e76d.jpg','2020-03-11 14:55:01',1),('1583938722769272526','1583938722769689788','/images/pic/abab01f1f5a4445f976d6b90bc6af7f9.jpg','2020-03-11 14:58:42',2),('1583938722769458862','1583938722769689788','/images/pic/be2cf1951c514c95b7b9f7cad0dc271b.jpg','2020-03-11 14:58:42',2),('1583938722769816278','1583938722769689788','/images/pic/55d01af7a21e4ede959abbdcf5fd807a.jpg','2020-03-11 14:58:42',2),('1583938997302205700','1583938997302470599','/images/pic/5e205f4ac69b4f8894600556ee630e2d.jpg','2020-03-11 15:03:17',1),('1583938997302317382','1583938997302470599','/images/pic/5860f65d12af4c348960a0ae64186c2b.jpg','2020-03-11 15:03:17',1),('1583938997302448197','1583938997302470599','/images/pic/dac583a7de6f472ca16633f4149672cd.jpg','2020-03-11 15:03:17',1),('1583939483588418892','1583939483587193411','/images/pic/61adf41627ba40ab8e5754c8b9cc6c15.jpg','2020-03-11 15:11:23',1),('1583939483588495947','1583939483587193411','/images/pic/d16f422e82254cf2955089ee48c6351f.jpg','2020-03-11 15:11:23',1),('1583939483588508090','1583939483587193411','/images/pic/4d1fe36d8a8b422da936f0613f311631.jpg','2020-03-11 15:11:23',1),('1583940546885272299','1583940546885846474','/images/pic/aa239a21d1364a7baf81eaaf74ec96eb.jpg','2020-03-11 15:29:06',1),('1583940546885687387','1583940546885846474','/images/pic/a7ac20bd1f8546b0a3c3278e45197b94.jpg','2020-03-11 15:29:06',1),('1583940546885968953','1583940546885846474','/images/pic/90e4576e60c74c0aa87236f591fb13d6.jpg','2020-03-11 15:29:06',1),('1583941082910191296','1583941082909141536','/images/pic/2fe9aab470274a40b21ee57026438c64.jpg','2020-03-11 15:38:02',2),('1583941082910242580','1583941082909141536','/images/pic/27783b56982847ee8fcaf5e0af7a0b83.jpg','2020-03-11 15:38:02',2),('1583941082910413091','1583941082909141536','/images/pic/5d3b36a4b7c647cab50e5491393fd2e1.jpg','2020-03-11 15:38:02',2),('1583941398323530692','1583941398323204767','/images/pic/1fc82ad9789a479faa57e4bd26ebeded.jpg','2020-03-11 15:43:18',1),('1583941398323592662','1583941398323204767','/images/pic/47db0a1da5ae4aa999b21aa8c4c39459.jpg','2020-03-11 15:43:18',1),('1583941398323817533','1583941398323204767','/images/pic/ba638637741a431794643e2bfb495419.png','2020-03-11 15:43:18',1),('1589681358727462933','1583937754237685707','/images/pic/538e7a1aca7d4532a1483752a90ed6bd.jpg','2020-05-17 02:09:18',1),('1589681358727520133','1583937754237685707','/images/pic/d7ca15fd8103486f97804e44e2a3e6d3.jpg','2020-05-17 02:09:18',1),('1589681358727647337','1583937754237685707','/images/pic/d866bba50abd4a7484d31fac8a2c9cf9.jpg','2020-05-17 02:09:18',1),('1589681541006260455','1583937436355876950','/images/pic/6fc52536b5e94f71bad000d62c70daaf.jpg','2020-05-17 02:12:21',1),('1589681541006357816','1583937436355876950','/images/pic/9542a9d3e0924ab0b442861efd4f3a19.jpg','2020-05-17 02:12:21',1),('1589681541006944473','1583937436355876950','/images/pic/083b2bdd03ba41258c4925788e7a15db.jpg','2020-05-17 02:12:21',1),('1589681623056307274','1583941082909141536','/images/pic/5d3b36a4b7c647cab50e5491393fd2e1.jpg','2020-05-17 02:13:43',1),('1589681623056941533','1583941082909141536','/images/pic/2fe9aab470274a40b21ee57026438c64.jpg','2020-05-17 02:13:43',1),('1589681623056942318','1583941082909141536','/images/pic/27783b56982847ee8fcaf5e0af7a0b83.jpg','2020-05-17 02:13:43',1),('1589681717391221785','1583935629583927102','/images/pic/01c5f9ab3f6b42a3ab91698de161861f.jpg','2020-05-17 02:15:17',1),('1589681717391839401','1583935629583927102','/images/pic/60878b86482449629c4186ebe2f753f8.jpg','2020-05-17 02:15:17',1),('1589681717391866766','1583935629583927102','/images/pic/96d07cf4e4d444b0810c47288c47e960.jpg','2020-05-17 02:15:17',1),('1589682075602489585','1583937021773641591','/images/pic/cc37842b3a374446a3a2b2919ccdf0a7.jpg','2020-05-17 02:21:15',1),('1589682075602943948','1583937021773641591','/images/pic/951680b5e22d48eaa0ee9ba589f02aac.jpg','2020-05-17 02:21:15',1),('1589682075602986132','1583937021773641591','/images/pic/81e8f40571ae4ff8bb8630551ec16d7f.jpg','2020-05-17 02:21:15',1),('1589682406793211434','1583935867326176449','/images/pic/356468fdd2b243158a031d92e37f6b97.jpg','2020-05-17 02:26:46',1),('1589682406793259068','1583935867326176449','/images/pic/edb291d92c264968a75aa384e3fa758e.jpg','2020-05-17 02:26:46',1),('1589682406793843576','1583935867326176449','/images/pic/fd83441f9b5c45aab8f608535435c7b9.jpg','2020-05-17 02:26:46',1),('1589682631351223032','1583936883626893988','/images/pic/a2f48d41f04e48f384fb49b0bf621902.jpg','2020-05-17 02:30:31',1),('1589682631351287134','1583936883626893988','/images/pic/b4f36a3487d34c2aaad116a84a75bba8.jpg','2020-05-17 02:30:31',1),('1589682631351418559','1583936883626893988','/images/pic/d6f2d6024acc4d6b9e1f3eecd2d9ec79.jpg','2020-05-17 02:30:31',1),('1589682735878258878','1583935356645701706','/images/pic/96347cab08dd48dc8eef7a2b483b0e0f.jpg','2020-05-17 02:32:15',1),('1589682735878372974','1583935356645701706','/images/pic/322917096e004b76b9f3863384bb2178.jpg','2020-05-17 02:32:15',1),('1589682735878873219','1583935356645701706','/images/pic/b5687d8111634fcb9b175bd5045b16cb.jpg','2020-05-17 02:32:15',1),('1589683627976290827','1583935632551786928','/images/pic/d15743e1cd2949828644e43f0d42766e.jpg','2020-05-17 02:47:07',1),('1589683627976349360','1583935632551786928','/images/pic/cdda2d5cec784b299b2102e1bc462868.jpg','2020-05-17 02:47:07',1),('1589683627976884684','1583935632551786928','/images/pic/33fa6aa1dde343e0a091a1dbdda0eae8.jpg','2020-05-17 02:47:07',1),('1589689513350322103','1583938722769689788','/images/pic/55d01af7a21e4ede959abbdcf5fd807a.jpg','2020-05-17 04:25:13',1),('1589689513350363618','1583938722769689788','/images/pic/be2cf1951c514c95b7b9f7cad0dc271b.jpg','2020-05-17 04:25:13',1),('1589689513350927565','1583938722769689788','/images/pic/abab01f1f5a4445f976d6b90bc6af7f9.jpg','2020-05-17 04:25:13',1),('1589693972666301604','1577792919764240135','/images/pic/3dfe006eb2ea45ddac3b75f98ab72da5.jpg','2020-05-17 05:39:32',2),('1589693972666417687','1577792919764240135','/images/pic/e41c6fda976a47d2bb07d10da6c44453.png','2020-05-17 05:39:32',2),('1589693972666512614','1577792919764240135','/images/pic/d280ac1a7b4a40a1822459a401e83592.jpg','2020-05-17 05:39:32',2),('1614221744960173148','1577792919764240135','/images/pic/e41c6fda976a47d2bb07d10da6c44453.png','2021-02-25 02:55:44',1),('1614221744960605605','1577792919764240135','/images/pic/3dfe006eb2ea45ddac3b75f98ab72da5.jpg','2021-02-25 02:55:44',1),('1614221744960792696','1577792919764240135','/images/pic/d280ac1a7b4a40a1822459a401e83592.jpg','2021-02-25 02:55:44',1),('1614222299098404986','1614222299098646065','/images/pic/30c74e3398ca4791bad873a4ce0bb4ba.jpg','2021-02-25 03:04:59',1),('1614222299098708112','1614222299098646065','/images/pic/b09b44217a664afa9db7167a4b4f810c.jpg','2021-02-25 03:04:59',1),('1614222299098758650','1614222299098646065','/images/pic/43d7d11c34444ad58ea726183fe0c1ce.jpg','2021-02-25 03:04:59',1),('1614222528786240613','1614222528785574194','/images/pic/e81d6b9532d94f119a28fa8da413c2b7.jpg','2021-02-25 03:08:48',1),('1614222528786463457','1614222528785574194','/images/pic/c16ebb2f9bfe4a6ead190640407680ed.jpg','2021-02-25 03:08:48',1),('1614222528786667143','1614222528785574194','/images/pic/643c0135635e4041a612ab19e5c36124.jpg','2021-02-25 03:08:48',1),('1684658505784460192','1684658505494770071','http://localhost:80/files/20230521/abc9052fe4a2415bb39612ff855ad800.jpg',NULL,1),('1684658505784461653','1684658505494770071','http://localhost:80/files/20230521/4c328a8da97c48198fa0977b38fac6ef.jpg',NULL,1),('1684658505784508317','1684658505494770071','http://localhost:80/files/20230521/cff11d23d1b540aa97eed0ad0ca4ef17.jpg',NULL,1);
/*!40000 ALTER TABLE `commimages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `commodity`
--

DROP TABLE IF EXISTS `commodity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `commodity` (
  `commid` varchar(64) NOT NULL COMMENT '商品id',
  `commname` varchar(255) DEFAULT NULL COMMENT '商品名',
  `commdesc` varchar(512) DEFAULT NULL COMMENT '商品描述',
  `videourl` varchar(255) DEFAULT NULL COMMENT '视频',
  `orimoney` decimal(55,2) DEFAULT NULL COMMENT '原价',
  `thinkmoney` decimal(55,2) DEFAULT NULL COMMENT '售价',
  `school` varchar(255) DEFAULT NULL COMMENT '商品所在学校',
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '发布时间',
  `updatetime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `endtime` timestamp NULL DEFAULT NULL COMMENT '结束时间',
  `commstatus` int DEFAULT '3' COMMENT '0违规 1正常 2删除  3待审核  4已售出',
  `common` varchar(255) DEFAULT NULL COMMENT '常用选项：自提，可小刀，不议价等选项',
  `rednumber` int DEFAULT '0' COMMENT '浏览量',
  `category` varchar(255) DEFAULT NULL COMMENT '商品类别',
  `image` varchar(255) DEFAULT NULL COMMENT '简介图',
  `userid` varchar(64) NOT NULL COMMENT '用户id',
  PRIMARY KEY (`commid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `commodity`
--

LOCK TABLES `commodity` WRITE;
/*!40000 ALTER TABLE `commodity` DISABLE KEYS */;
INSERT INTO `commodity` VALUES ('1577792919764240135','iPhone X ','品牌: Apple/苹果，Apple型号: iPhone X，版本类型：中国大陆，分辨率: 2436x1125像素，网络类型: 4G+全网通 4G全网通 4G+全网通 4G全网通，CPU核心数: 六核，运行内存RAM: 3GB，存储容量: 64GB，后置摄像头: 双1200万，摄像头类型: 三摄像头（后双）,6.1英寸。','/static/pic/a941efee4d2f4af786b3ee7f9dd8c868.mp4',3560.00,3000.00,'清华大学','2019-12-31 11:48:39','2023-05-21 06:29:22',NULL,3,'可小刀、仅自提',28,'3C数码','/images/pic/f9096910fe9540648b3f967ed552940d.jpg','1577713712942250291'),('1577793367826729923','华为 nova 6 SE','品牌名称：HUAWEI,证书编号：2019011606250738,证书状态：有效产品名称：TD-LTE数字移动电话机3C规格型号：JNY-AL10(开关电源适配器I：HW-100400C01 输出:5VDC 2A或9VDC 2A或...产品名称：HUAWEI nova 6 SE华为型号: Nova 6 SE机身颜色: 幻夜黑 绮境森林 樱雪晴空运行内存RAM: 8GB存储容量: 8+128GB网络模式: 双卡双待CPU型号: HUAWEI Kirin 810（麒麟810）','/static/pic/a0b57bbeba2c4ec9b8d9fc75eb9f711a.mp4',2199.00,2000.00,'清华大学','2019-12-31 11:56:07','2023-05-21 06:29:21','2023-05-21 07:15:42',1,'不议价、可送货',14,'3C数码','/images/pic/f2044cc340d140b9b5de39e31924d9fa.jpg','1577713712942250291'),('1581842827758285459','联想(Lenovo)小新Pro','13.3英寸英特尔酷睿i5全面屏超轻薄笔记本电脑(I5-10210U 16G 512G MX250 2.5K QHD)银','/static/pic/505bbf62c91f4fba8e22ad993675db40.mp4',6299.00,5299.00,'清华大学','2020-02-16 08:47:07','2023-05-21 06:29:17',NULL,1,'不议价、可送货',2,'3C数码','/images/pic/6733d5e05d89417f9d55ba6a4157de32.png','1577713712942250291'),('1582551912499825271','Apple iPad Pro','Apple iPad Pro11英寸平板电脑2018年新款（256G WLAN+Cellular/全面屏/A12X芯片/Face ID MU152CH/A）深空灰','/static/pic/d7aef760c309469f8785c39cbc301bd9.mp4',8299.00,8200.00,'北京大学','2020-02-24 13:45:12','2023-05-21 06:29:15',NULL,1,'不议价、可送货',2,'3C数码','/images/pic/20caea45206c4ac992141fe5a305c285.png','1577713712942250291'),('1583934830542354596','Java从入门到精通（第5版）','Java从入门到精通（第5版）Java从入门到精通（第5版）Java从入门到精通（第5版）','/static/pic/da89b6ff657e438d8aad36fd62135534.mp4',89.10,55.00,'清华大学','2020-03-11 13:53:50','2023-05-21 06:29:21',NULL,3,'不议价、可送货',2,'书籍','/images/pic/f847726176b04071bfe070473dda9c05.jpg','1577713712942250291'),('1583935025023726250','Python 3网络爬虫开发实战','Python 3网络爬虫开发实战Python 3网络爬虫开发实战Python 3网络爬虫开发实战','',49.50,30.00,'清华大学','2020-03-11 13:57:05','2023-05-21 06:29:20','2023-05-21 07:24:18',1,'不议价、可送货',2,'书籍','/images/pic/ddce3da8dca9438e81666dd580a96c08.jpg','1577713712942250291'),('1583935120549879620','Python全栈开发三剑客 （京东套装共3册）','Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）Python全栈开发三剑客 （京东套装共3册）','',283.00,268.00,'清华大学','2020-03-11 13:58:40','2023-05-21 06:29:17',NULL,4,'可小刀、可送货',23,'书籍','/images/pic/a049f22e304a4376be461d136f32df25.jpg','1577713712942250291'),('1583935211397204485','基于Python的大数据分析基础及实战','基于Python的大数据分析基础及实战基于Python的大数据分析基础及实战基于Python的大数据分析基础及实战基于Python的大数据分析基础及实战','',66.30,50.00,'清华大学','2020-03-11 14:00:11','2023-05-21 06:29:21',NULL,1,'不议价、仅自提',23,'书籍','/images/pic/f658930d144342749014995fc3a1a07c.jpg','1577713712942250291'),('1583935356645701706','Python神经网络编程','Python神经网络编程Python神经网络编程Python神经网络编程Python神经网络编程','',34.50,30.00,'清华大学','2020-03-11 14:02:36','2023-05-21 06:29:15',NULL,1,'不议价、仅自提',8,'书籍','/images/pic/3358824f71b044f5b4cca3514b310915.jpg','1577713712942250291'),('1583935476800117681','物联网Python开发实战','物联网Python开发实战物联网Python开发实战物联网Python开发实战物联网Python开发实战物联网Python开发实战','',44.70,40.00,'清华大学','2020-03-11 14:04:36','2023-05-21 06:29:18',NULL,3,'可小刀、可送货',2,'书籍','/images/pic/b40054592cca412ca96dd58ab2a8b3a4.jpg','1577713712942250291'),('1583935629583927102','漫步者（EDIFIER）TWS2','漫步者（EDIFIER）TWS2 真无线蓝牙耳机 运动耳机 迷你入耳式手机耳机 通用苹果华为小米手机 黑色，几乎全新','/static/pic/a5f7332094e94f138bf8b50cbd5e287d.mp4',299.00,169.00,'清华大学','2020-03-11 14:07:09','2023-05-21 06:29:16',NULL,3,'可小刀、可送货',4,'3C数码','/images/pic/360968f3e60e4ca4b1f16b6a2e340e2d.jpg','1582184795951594874'),('1583935632551786928','茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列','茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列','/static/pic/8fd07e4a081a4821b564bb1686f4d621.mp4',11.90,9.90,'清华大学','2020-03-11 14:07:12','2023-05-21 06:29:16',NULL,3,'不议价、可送货',0,'生活用品','/images/pic/44c5a6e37b0a462aa201bb92ba1978e5.jpg','1577713712942250291'),('1583935731015473292',' 尚格兰 强力无痕免打孔浴室置物架2套 厨房厕所卫生间置物架肥皂盒毛巾架（方形 百搭白色）',' 尚格兰 强力无痕免打孔浴室置物架2套 厨房厕所卫生间置物架肥皂盒毛巾架（方形 百搭白色） 尚格兰 强力无痕免打孔浴室置物架2套 厨房厕所卫生间置物架肥皂盒毛巾架（方形 百搭白色） 尚格兰 强力无痕免打孔浴室置物架2套 厨房厕所卫生间置物架肥皂盒毛巾架（方形 百搭白色）','/static/pic/fc949db2d1ce47e191b87c57781bc192.mp4',28.50,20.00,'清华大学','2020-03-11 14:08:51','2023-05-21 06:29:16',NULL,1,'不议价、可送货',0,'生活用品','/images/pic/49f2c0867e894c52be0a6b2f8897cea8.jpg','1577713712942250291'),('1583935867326176449','雅高 浴帘杆 晾衣杆 ','雅高 浴帘杆 晾衣杆 伸缩窗帘杆 不锈钢浴帘撑衣杆 免打孔浴帘杆加厚不锈钢窗帘杆晾衣杆 110-200cm','/static/pic/92213aeb0c194b67b7681a58a8032278.mp4',29.90,25.00,'清华大学','2020-03-11 14:11:07','2023-05-21 06:29:18',NULL,3,'不议价、可送货',0,'生活用品','/images/pic/a2c278230bc84132a55bace56709d093.jpg','1577713712942250291'),('1583936216831713367','闪迪 （SanDisk） 32GB USB3.0 U盘','闪迪 （SanDisk） 32GB USB3.0 U盘 CZ600酷悠 黑色 USB3.0入门优选 时尚办公必备 时尚外观，便携伸缩口设计','/static/pic/89f92912ff5647fc813ffe00e697bc8c.mp4',29.90,16.00,'北京大学','2020-03-11 14:16:56','2023-05-21 06:29:19',NULL,3,'不议价、可送货',2,'3C数码','/images/pic/c65cd8fa45434a8b8978106dc0b67e8a.jpg','1582184795951594874'),('1583936883626893988','扫把挂夹卫生间置物架 ','贝瑟斯 强力吸盘拖把架浴室免打孔挂钩无痕粘钩扫把架卫生间拖把扫把挂夹卫生间置物架 2个装','/static/pic/b29e503fa9f74ad783eb1348e7f0b06d.mp4',25.90,20.00,'清华大学','2020-03-11 14:28:03','2023-05-21 06:29:15',NULL,3,'不议价、可送货',0,'生活用品','/images/pic/05434d93292948569d39cb11ec16dfbe.jpg','1577713712942250291'),('1583937015909416441','中文版3ds Max 2016从入门到精通','中文版3ds Max 2016从入门到精通（全彩印 微课视频版）243集视频讲解171个实例案例3dmax教程','/static/pic/70d9d46ee1204765a7b2efd929064c5e.mp4',94.80,69.00,'清华大学','2020-03-11 14:30:15','2023-05-21 06:29:15',NULL,1,'可小刀、仅自提',7,'书籍','/images/pic/060e9030ca4445edae278ef09caad51d.jpg','1582184795951594874'),('1583937021773641591','一次性地漏贴纸','家の物语（KATEI STORY） 日本20片装一次性地漏贴纸毛发头发过滤网下水道防堵过滤器 地漏宝','/static/pic/48945f7328154d10b05a4009b5eefe0e.mp4',18.60,18.00,'清华大学','2020-03-11 14:30:21','2023-05-21 06:29:15',NULL,3,'不议价、可送货',0,'生活用品','/images/pic/2bc1b9dce1514b1891350ae855a1e1a6.jpg','1577713712942250291'),('1583937153164789685','男士外套春秋2020','花花公子(PLAYBOY) 男士外套春秋2020新款韩版潮流帅气春装棒球服机能休闲夹克 军绿色 XL','',269.00,228.00,'清华大学','2020-03-11 14:32:33','2023-05-21 06:29:19',NULL,1,'不议价、可送货',4,'服饰','/images/pic/cff96b7a79df42c0ab52cf75e134ab70.jpg','1577713712942250291'),('1583937266660587070','男士外套春季新款','克伦苏 夹克男士外套春季新款韩版修身潮流男装休闲衣服学生连帽工装 短款上衣男装 黑色 L','',168.00,128.00,'清华大学','2020-03-11 14:34:26','2023-05-21 06:29:15',NULL,1,'不议价、可送货',2,'服饰','/images/pic/1ef8aa2ea7994c2caee544fc9a59109a.jpg','1577713712942250291'),('1583937436355876950','活着','书名：活着 该本书是25周年典藏纪念版 余华小说作品集','/static/pic/75b0c96d919e417b8786ffb888ebbda5.mp4',23.00,10.00,'北京大学','2020-03-11 14:37:16','2023-05-21 06:29:16',NULL,1,'可小刀、仅自提',19,'书籍','/images/pic/363a83abbf934c2bbb8d3ec0634108ff.jpg','1582184795951594874'),('1583937609451390776','茶花 漱口杯刷牙杯子','茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列','/static/pic/fe07b77dbd6042fd937a4f57c0c9898d.mp4',12.00,5.00,'清华大学','2020-03-11 14:40:09','2023-05-21 06:29:18',NULL,1,'不议价、仅自提',4,'3C数码','/images/pic/afb276a42d8b4baaaf94e8928bfa5827.jpg','1582184795951594874'),('1583937754237685707','湘鑫宏日式垃圾桶','湘鑫宏日式垃圾桶，北欧风格，家用垃圾篓大号，时尚筒带盖小卫生间\r\n创意、简约、干湿分类、压圈垃圾桶\r\n日系白色印花小鹿','/static/pic/3cedae97308b4eb89145fc5df5273546.mp4',36.00,10.00,'北京大学','2020-03-11 14:42:34','2023-05-21 06:29:17',NULL,3,'不议价、可送货',17,'生活用品','/images/pic/94d93437727f40428c7663c36d0e8a88.jpg','1582184795951594874'),('1583938217414801162','绅范工装外套男装2020春季新品夹克','绅范工装外套男装2020春季新品夹克男士潮牌春秋风衣青年休闲牛仔春装衣服男潮流百搭大码棒球服褂子上衣 66#黑色 XL','/static/pic/6c56a030d62742d68528a05094386cb6.mp4',158.00,66.00,'清华大学','2020-03-11 14:50:17','2023-05-21 06:29:18','2023-05-21 07:26:55',1,'不议价、可送货',8,'服饰','/images/pic/aaeb8a085aa84c498a48acde792ef0e9.jpg','1582184795951594874'),('1583938501381902202','南极人2020春季新款男士韩版休闲牛仔外套','南极人2020春季新款男士韩版休闲牛仔外套潮流秋冬装ins港仔文艺夹克上衣服 605白黑【单件】 XL/120-135斤','/static/pic/35a63fe6f2e542e39deda10bf5477942.mp4',139.00,85.00,'北京大学','2020-03-11 14:55:01','2023-05-21 06:29:20',NULL,1,'可小刀、可送货',7,'服饰','/images/pic/dd1bca94e5fa4f86a48addb5fee1d300.jpg','1582184795951594874'),('1583938722769689788',' 京东京造 3只装美妆蛋 葫芦型/水滴型 ','京东京造 3只装美妆蛋 葫芦型/水滴型 化妆海绵彩妆蛋 立体粉扑化妆蛋（干湿两用 遇水变大）','/static/pic/9d97be5a81d345ed8bf02e818507af27.mp4',29.90,10.00,'清华大学','2020-03-11 14:58:42','2023-05-21 06:29:20',NULL,1,'不议价、可送货',0,'美妆','/images/pic/de3eb635010a4eb1856227ec21b07d01.jpg','1582184795951594874'),('1583938997302470599','旅行套装60ml三件套','悦美时刻 INS北欧风化妆品分装瓶旅行套装60ml三件套 软管挤压式乳液瓶 清洁消毒分装瓶 便携空瓶 60ml*3(北欧色三件套）','/static/pic/5744794dba2b4e8e83a40b2c7d61fc82.mp4',25.90,10.00,'北京大学','2020-03-11 15:03:17','2023-05-21 06:29:19','2023-05-21 07:26:31',1,'不议价、可送货',16,'美妆','/images/pic/cb8557aaa0214efba831da941e04d138.jpg','1582184795951594874'),('1583939483587193411','上海永久山地车','上海永久(forever)山地车自行公路越野城市休闲户外运动男女青少年单车骑行减震碟刹变速脚踏折叠 高配辐条-黑白色 24寸21速(适合身高150-170cm)','/static/pic/260f7b05d8824a3d8961df9befa1db60.mp4',688.00,260.00,'清华大学','2020-03-11 15:11:23','2023-05-21 06:29:19','2023-05-21 07:26:46',1,'可小刀、可送货',29,'出行','/images/pic/c8860405275847f497a76df181fb1d0c.png','1582184795951594874'),('1583940546885846474','爱玛电动车 小爱蜜','爱玛电动车 小爱蜜 电动自行车学生代步电瓶车 前后真空胎 带脚踏 加长舒适后减震 3C大证 新国标 奶白咖啡 新国标','/static/pic/18502d7d88f148cbb2b6e0f6fd30af7e.mp4',2499.00,1200.00,'北京大学','2020-03-11 15:29:06','2023-05-21 06:29:14',NULL,1,'可小刀、可送货',34,'出行','/images/pic/0524acc413cc48809c329b1f66ed50c3.jpg','1582184795951594874'),('1583941082909141536','床上书桌','木以成居 几乎全新电脑桌 大学生宿舍桌子上下铺带收纳书架床上书桌懒人笔记本桌写字台 竹木色LY-4001A','/static/pic/663e4379787940f887ff06f8756b6cd4.mp4',99.00,30.00,'清华大学','2020-03-11 15:38:02','2023-05-21 06:29:19','2023-05-21 07:26:39',1,'可小刀、可送货',3,'其他','/images/pic/c8b6c2605d744ce296d8375ebbce6107.jpg','1582184795951594874'),('1583941398323204767',' 萨伽单木吉他','萨伽SAGA 单板民谣吉他面单木吉他41寸40寸吉它初学者乐器 云杉原木色 SF700C 41寸缺角','/static/pic/17c70d8fc9fb43888fd445813e4ced9f.mp4',990.00,500.00,'北京大学','2020-03-11 15:43:18','2023-05-21 06:29:22','2023-05-21 13:07:27',1,'可小刀、可送货',85,'其他','/images/pic/fe2eb09ceb034dbbaf23cfcda869d2f3.jpg','1582184795951594874'),('1614222528785574194','联想ThinkBook 15 2021款','商品名称：ThinkPadThinkBook 1 背光键盘，指纹识别屏幕尺寸：15.0英寸-15.9英寸系列：ThinkBook 15裸机重量：1.5-2kg机械硬盘：无机械硬盘处理器：Intel i7屏幕刷新率16G固态硬盘（SSD）：512GB颜色：银色','',5999.00,4999.00,'北京大学','2021-02-25 03:08:48','2023-05-21 07:35:56','2023-05-21 14:01:14',1,'不议价、可送货',45,'3C数码','/images/pic/ee09d458c60041b0a66c05477f71c851.jpg','1577713712942250291'),('1684658505494770071','1','1','http://localhost:80/files/20230521/5a8c3b46882b4f8d8736daf28d96c347.mp4',1.00,1.00,'北京大学',NULL,NULL,'2023-05-21 08:42:12',3,'不议价、可送货',2,'3C数码','http://localhost:80/files/20230521/988b6792c7b44c6ba65cf41d0903cfbc.png','1589628308220845788');
/*!40000 ALTER TABLE `commodity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friends`
--

DROP TABLE IF EXISTS `friends`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `friends` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(64) DEFAULT NULL COMMENT '用户id',
  `fuserid` varchar(64) DEFAULT NULL COMMENT '好友id',
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friends`
--

LOCK TABLES `friends` WRITE;
/*!40000 ALTER TABLE `friends` DISABLE KEYS */;
INSERT INTO `friends` VALUES (1,'1577713712942250291','1582184795951594874','2020-04-18 10:04:45'),(2,'1582184795951594874','1577713712942250291','2020-04-18 10:04:47'),(7,'1577713712942250291','1587889073148226284','2021-02-25 03:51:51'),(8,'1587889073148226284','1577713712942250291','2021-02-25 03:51:51'),(9,'1589628308220845788','1582184795951594874','2021-03-08 05:09:53'),(10,'1582184795951594874','1589628308220845788','2021-03-08 05:09:53'),(11,'1589628308220845788','1577713712942250291','2023-05-21 07:39:46'),(12,'1577713712942250291','1589628308220845788','2023-05-21 07:39:48');
/*!40000 ALTER TABLE `friends` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `keywords`
--

DROP TABLE IF EXISTS `keywords`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `keywords` (
  `id` int NOT NULL AUTO_INCREMENT,
  `keyword` varchar(200) DEFAULT NULL,
  `enable` int DEFAULT '1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `keyword` (`keyword`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `keywords`
--

LOCK TABLES `keywords` WRITE;
/*!40000 ALTER TABLE `keywords` DISABLE KEYS */;
/*!40000 ALTER TABLE `keywords` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `keywords_data`
--

DROP TABLE IF EXISTS `keywords_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `keywords_data` (
  `id` int NOT NULL AUTO_INCREMENT,
  `keyword_id` int DEFAULT NULL,
  `wb_id` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `keywords_data`
--

LOCK TABLES `keywords_data` WRITE;
/*!40000 ALTER TABLE `keywords_data` DISABLE KEYS */;
/*!40000 ALTER TABLE `keywords_data` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `login`
--

DROP TABLE IF EXISTS `login`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `login` (
  `id` varchar(64) NOT NULL COMMENT '登录id',
  `userid` varchar(64) DEFAULT NULL COMMENT '用户id',
  `roleid` int DEFAULT '1' COMMENT '角色id 1普通用户 2管理员 3超级管理员',
  `username` varchar(255) DEFAULT NULL COMMENT '用户名',
  `password` varchar(255) DEFAULT NULL COMMENT '用户密码',
  `mobilephone` varchar(255) DEFAULT NULL COMMENT '手机号',
  `userstatus` int DEFAULT '1' COMMENT '1正常 0封号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `login`
--

LOCK TABLES `login` WRITE;
/*!40000 ALTER TABLE `login` DISABLE KEYS */;
INSERT INTO `login` VALUES ('1582184795951399057','1582184795951594874',2,'猫儿','1cd75ca00db28072479992f87d4a647e','15239670412',1),('1587916027545989364','1587889073148226284',1,'鱼与飞鸟','1cd75ca00db28072479992f87d4a647e','123456783',1),('1587916417975156426','1577713712942250291',2,'理木客','1cd75ca00db28072479992f87d4a647e','15239670411',1),('1589627579283989738','1589627579283677652',1,'木子','1cd75ca00db28072479992f87d4a647e','123456784',1),('1589628285110931399','1589628308220845788',3,'admin','1cd75ca00db28072479992f87d4a647e','admin',1),('1589644044287650587','1589644044287166342',1,'Rose','1cd75ca00db28072479992f87d4a647e','123456785',1),('1589680953404999878','1589680953404254146',1,'种鱼的猫猫','1cd75ca00db28072479992f87d4a647e','15239670413',1),('1589694955949272106','1589694955949934523',1,'那些年','1cd75ca00db28072479992f87d4a647e','15239670414',1);
/*!40000 ALTER TABLE `login` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `news`
--

DROP TABLE IF EXISTS `news`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `news` (
  `id` varchar(64) NOT NULL COMMENT '新闻id',
  `newstitle` varchar(255) DEFAULT NULL COMMENT '新闻标题',
  `newsdesc` varchar(255) DEFAULT NULL COMMENT '新闻简介',
  `newscontent` longtext COMMENT '新闻内容',
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '发布时间',
  `username` varchar(255) DEFAULT NULL COMMENT '新闻发布者',
  `image` varchar(255) DEFAULT NULL COMMENT '新闻简介图',
  `newsstatus` int DEFAULT '1' COMMENT '1正常  2删除',
  `rednumber` int DEFAULT '0' COMMENT '浏览量',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `news`
--

LOCK TABLES `news` WRITE;
/*!40000 ALTER TABLE `news` DISABLE KEYS */;
INSERT INTO `news` VALUES ('1587195192937820552','校园互助平台上线啦','校园互助平台上线啦：环保公益两不误，与你相约在校园互助平台','<p>校园互助平台上线，欢迎同学们注册使用，我们的口号是：<span>环保公益两不误，与你相约在校园互助平台。</span></p>','2020-04-18 07:33:12','猫给这儿','/images/pic/4dd1b2b01a5148ae93731906073aab2d.jpg',1,21),('1587195902011331190','校园二手商铺招贤纳士','了能够更好、更快的为同学们服务，以及让更多同学的闲置商品不再成为闲置，让更多的同学知道我们这个平台','<p>为了能够更好、更快的为同学们服务，以及让更多同学的闲置商品不再成为闲置，让更多的同学知道我们这个平台，我们决定招收热心、负责、具有良好的沟通能力的推广人员。</p><p>岗位职责</p><p>以活跃用户、发展新用户为目标导向，策划线上、线下营销活动，并对活动主题及创意进行包装；</p><p><br></p><p>围绕部门的推广计划、推广策略、商务合作计划等，制定各类活动方案，并组织实施；</p><p><br></p><p>监控具体活动执行效果，及时总结汇报，并提出相应活动优化方案；</p><p><br></p><p>独立撰写各类新闻稿、创意广告、宣传推广软文；</p><p><br></p><p>负责公司产品推广宣传册，活动礼品、物料的采购；</p><p><br></p><p>搜集、整理和分析竞品信息，了解市场竞争趋势，定期统计、分析各类数据，提供市场分析报告，为上级提供决策依据。</p><p><br></p>','2020-04-18 07:45:02','猫给这儿','/images/pic/e179f1fc8a4e41b78449d20f5c5ff6c3.jpg',1,34),('1587198376975919635','校园互助平台常见问题','校园互助平台常见问题汇总：校园互助平台销售的商品来源的渠道是什么呢？你们的维修售后怎么保障的？关于本站用户关于交易','<p>1、校园互助平台销售的商品来源的渠道是什么呢？</p><p>校园互助平台所销售的设备均来自于合法正规渠道，包括但不限于顾客闲置、国内专业回收机构等，从源头保证机器处于良好的使用状态。请您放心购买。</p><p>2、你们的维修售后怎么保障的？</p><p>校园互助平台不负责商品的售后服务，商品的售后服务请联系卖家。</p><p>3、关于本站用户</p><p>本站用户基本都是各个高校大学生，学校名称，姓名、性别必须与学生证与身份证信息一致。</p><p>4、关于交易</p><p>目前不支持线上交易，用户自行线下交易，本网站对此概不负责 。</p>','2020-04-18 08:26:17','猫给这儿','/images/pic/26b019d2b5484ef981a7bbdf857e12bb.jpg',1,55),('1587368182859188837','测试','大大大大','法发噶阿嘎','2020-04-20 07:36:22','猫给这儿','/images/pic/42f523dc83864c5ab1f67268dbe45cc1.jpg',2,1);
/*!40000 ALTER TABLE `news` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `notices`
--

DROP TABLE IF EXISTS `notices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notices` (
  `id` varchar(64) NOT NULL COMMENT '通知id',
  `userid` varchar(64) DEFAULT NULL COMMENT '用户id',
  `whys` varchar(255) DEFAULT NULL COMMENT '通知内容',
  `isread` int DEFAULT '0' COMMENT '是否阅读 0未阅读 1已阅读',
  `tpname` varchar(255) DEFAULT NULL COMMENT '通知类型',
  `nttime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '通知时间',
  `latest` int DEFAULT '1' COMMENT '是否为新通知 1是 2不是',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notices`
--

LOCK TABLES `notices` WRITE;
/*!40000 ALTER TABLE `notices` DISABLE KEYS */;
INSERT INTO `notices` VALUES ('1588250830237539282','1582184795951594874','您的商品 <a href=/product-detail/1583938501381902202 style=\"color:#08bf91\" target=\"_blank\" >南极人2020春季新款男士韩版休闲牛仔外套</a> 已通过审核，快去看看吧。',1,'商品审核','2020-04-30 12:47:10',2),('1588251035517231786','1582184795951594874','恭喜您已被设置为网站管理员，努力维护网站的良好氛围。',1,'系统通知','2020-04-30 12:50:35',2),('1588251042987446364','1582184795951594874','您已被设置为网站用户，希望您再接再厉。',1,'系统通知','2020-04-30 12:50:42',2),('1588251050454258295','1582184795951594874','您的商品 <a href=/product-detail/1583937754237685707 style=\"color:#08bf91\" target=\"_blank\" >湘鑫宏日式垃圾桶</a> 已通过审核，快去看看吧。',1,'商品审核','2020-04-30 12:50:50',2),('1588251204824159064','1582184795951594874','您的商品 <a href=/product-detail/1583939483587193411 style=\"color:#08bf91\" target=\"_blank\" >上海永久山地车</a> 被评论了，快去看看吧。',1,'评论','2020-04-30 12:53:24',2),('1588252223487672096','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 未通过审核，目前不支持公开发布。',1,'商品审核','2020-04-30 13:10:23',2),('1588252371050431095','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 已通过审核，快去看看吧。',1,'商品审核','2020-04-30 13:12:51',2),('1588262384763845040','1582184795951594874','有小伙伴在 <a href=/product-detail/1583939483587193411 style=\"color:#08bf91\" target=\"_blank\" >上海永久山地车</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2020-04-30 15:59:44',2),('1589636544748325349','1589627579283677652','因为您的不良行为，您在该网站的账号已被封号。',0,'系统通知','2020-05-16 13:42:24',1),('1589636594522226396','1589627579283677652','您在该网站的账号已被解封，希望您保持良好的行为。',0,'系统通知','2020-05-16 13:43:14',1),('1589638217090767109','1582184795951594874','您的商品 <a href=/product-detail/1583938217414801162 style=\"color:#08bf91\" target=\"_blank\" >绅范工装外套男装2020春季新品夹克</a> 已通过审核，快去看看吧。',0,'商品审核','2020-05-16 14:10:17',2),('1589638232080391899','1582184795951594874','您的商品 <a href=/product-detail/1583939483587193411 style=\"color:#08bf91\" target=\"_blank\" >上海永久山地车</a> 已通过审核，快去看看吧。',0,'商品审核','2020-05-16 14:10:32',2),('1589638243792827379','1582184795951594874','您的商品 <a href=/product-detail/1583937015909416441 style=\"color:#08bf91\" target=\"_blank\" >中文版3ds Max 2016从入门到精通</a> 已通过审核，快去看看吧。',0,'商品审核','2020-05-16 14:10:43',2),('1589638785531551867','1577713712942250291','您的商品 <a href=/product-detail/1577792919764240135 style=\"color:#08bf91\" target=\"_blank\" >iPhone X </a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-16 14:19:45',2),('1589681358735485766','1582184795951594874','您的商品 <a href=/product-detail/1583937754237685707 style=\"color:#08bf91\" target=\"_blank\" >湘鑫宏日式垃圾桶</a> 进入待审核队列，请您耐心等待。',0,'商品审核','2020-05-17 02:09:18',2),('1589681541011152986','1582184795951594874','您的商品 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 进入待审核队列，请您耐心等待。',0,'商品审核','2020-05-17 02:12:21',2),('1589681623060802460','1582184795951594874','您的商品 <a href=/product-detail/1583941082909141536 style=\"color:#08bf91\" target=\"_blank\" >床上书桌</a> 进入待审核队列，请您耐心等待。',0,'商品审核','2020-05-17 02:13:43',2),('1589681717395332736','1582184795951594874','您的商品 <a href=/product-detail/1583935629583927102 style=\"color:#08bf91\" target=\"_blank\" >漫步者（EDIFIER）TWS2</a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:15:17',2),('1589682075608824357','1577713712942250291','您的商品 <a href=/product-detail/1583937021773641591 style=\"color:#08bf91\" target=\"_blank\" >一次性地漏贴纸</a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:21:15',2),('1589682406798257020','1577713712942250291','您的商品 <a href=/product-detail/1583935867326176449 style=\"color:#08bf91\" target=\"_blank\" >雅高 浴帘杆 晾衣杆 </a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:26:46',2),('1589682631355190969','1577713712942250291','您的商品 <a href=/product-detail/1583936883626893988 style=\"color:#08bf91\" target=\"_blank\" >扫把挂夹卫生间置物架 </a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:30:31',2),('1589682735882955561','1577713712942250291','您的商品 <a href=/product-detail/1583935356645701706 style=\"color:#08bf91\" target=\"_blank\" >Python神经网络编程</a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:32:15',2),('1589683627982523739','1577713712942250291','您的商品 <a href=/product-detail/1583935632551786928 style=\"color:#08bf91\" target=\"_blank\" >茶花 漱口杯刷牙杯子牙刷杯牙缸洗漱杯水杯 257004 艾特斯系列</a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 02:47:07',2),('1589689513365251929','1582184795951594874','您的商品 <a href=/product-detail/1583938722769689788 style=\"color:#08bf91\" target=\"_blank\" > 京东京造 3只装美妆蛋 葫芦型/水滴型 </a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 04:25:13',2),('1589693781569642519','1582184795951594874','您的商品 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-17 05:36:21',2),('1589693785983511157','1582184795951594874','您的商品 <a href=/product-detail/1583938722769689788 style=\"color:#08bf91\" target=\"_blank\" > 京东京造 3只装美妆蛋 葫芦型/水滴型 </a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-17 05:36:25',2),('1589693790411331579','1582184795951594874','您的商品 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-17 05:36:30',2),('1589693794459326444','1582184795951594874','您的商品 <a href=/product-detail/1583941082909141536 style=\"color:#08bf91\" target=\"_blank\" >床上书桌</a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-17 05:36:34',2),('1589693801555215190','1577713712942250291','您的商品 <a href=/product-detail/1583935356645701706 style=\"color:#08bf91\" target=\"_blank\" >Python神经网络编程</a> 已通过审核，快去看看吧。',1,'商品审核','2020-05-17 05:36:41',2),('1589693972672634667','1577713712942250291','您的商品 <a href=/product-detail/1577792919764240135 style=\"color:#08bf91\" target=\"_blank\" >iPhone X </a> 进入待审核队列，请您耐心等待。',1,'商品审核','2020-05-17 05:39:32',2),('1614221617091301936','1582184795951594874','您的商品 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 未通过审核，目前不支持公开发布。',1,'商品审核','2021-02-25 02:53:37',2),('1614221621842813317','1582184795951594874','您的商品 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 已通过审核，快去看看吧。',1,'商品审核','2021-02-25 02:53:41',2),('1614221665081272935','1577713712942250291','您的商品 <a href=/product-detail/1577792919764240135 style=\"color:#08bf91\" target=\"_blank\" >iPhone X </a> 未通过审核，目前不支持公开发布。',1,'商品审核','2021-02-25 02:54:25',2),('1614221744968644140','1577713712942250291','您的商品 <a href=/product-detail/1577792919764240135 style=\"color:#08bf91\" target=\"_blank\" >iPhone X </a> 进入待审核队列，请您耐心等待。',1,'商品审核','2021-02-25 02:55:44',2),('1614222299102195899','1587889073148226284','您的商品 <a href=/product-detail/1614222299098646065 style=\"color:#08bf91\" target=\"_blank\" >联想ThinkBook 15 2021款 酷睿版 英特尔酷睿i7 15.6英寸轻薄笔记本(i7-1165G7 16G 512G MX450独显 高色域)</a> 进入待审核队列，请您耐心等待。',0,'商品审核','2021-02-25 03:04:59',1),('1614222528788549206','1587889073148226284','您的商品 <a href=/product-detail/1614222528785574194 style=\"color:#08bf91\" target=\"_blank\" >联想ThinkBook 15 2021款</a> 进入待审核队列，请您耐心等待。',0,'商品审核','2021-02-25 03:08:48',1),('1614222544530657401','1587889073148226284','您的商品 <a href=/product-detail/1614222528785574194 style=\"color:#08bf91\" target=\"_blank\" >联想ThinkBook 15 2021款</a> 已通过审核，快去看看吧。',0,'商品审核','2021-02-25 03:09:04',1),('1614225697523382543','1582184795951594874','您的商品 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 被评论了，快去看看吧。',1,'评论','2021-02-25 04:01:37',2),('1614225873183378502','1582184795951594874','有小伙伴在 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:04:33',2),('1614226211682549008','1577713712942250291','有小伙伴在 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:10:11',2),('1614226272830999912','1577713712942250291','有小伙伴在 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:11:12',2),('1614226412763723438','1577713712942250291','有小伙伴在 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:13:32',2),('1614226445535726188','1577713712942250291','有小伙伴在 <a href=/product-detail/1583941398323204767 style=\"color:#08bf91\" target=\"_blank\" > 萨伽单木吉他</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:14:05',2),('1614226508680695911','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 被评论了，快去看看吧。',1,'评论','2021-02-25 04:15:08',2),('1614226529651307429','1577713712942250291','有小伙伴在 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 下回复了您的评论，快去看看吧。',1,'评论回复','2021-02-25 04:15:29',2),('1615031012523810894','1577713712942250291','您已成功购买 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 请随时查看物流信息。',1,'系统通知','2021-03-06 11:43:32',2),('1615031012532993796','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 被购买了，请及时发货。',1,'系统通知','2021-03-06 11:43:32',2),('1615031880816901962','1577713712942250291','您购买的 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 已经发货， 请注意查看物流信息。',1,'系统通知','2021-03-06 11:58:00',2),('1615031902328425566','1582184795951594874','您售出的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 已经被收货啦。',1,'系统通知','2021-03-06 11:58:22',2),('1615091489913535674','1577713712942250291','您已成功购买 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 请随时查看物流信息。',1,'系统通知','2021-03-07 04:31:29',2),('1615091489925245027','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 被购买了，请及时发货。',1,'系统通知','2021-03-07 04:31:29',2),('1615178062006105218','1577713712942250291','您已成功购买 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 请随时查看物流信息。',1,'系统通知','2021-03-08 04:34:22',2),('1615178062009857148','1582184795951594874','您的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 被购买了，请及时发货。',1,'系统通知','2021-03-08 04:34:22',2),('1615178094277609121','1577713712942250291','您购买的 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 已经发货， 请注意查看物流信息。',1,'系统通知','2021-03-08 04:34:54',2),('1615178107237738372','1582184795951594874','您售出的商品 <a href=/product-detail/1583940546885846474 style=\"color:#08bf91\" target=\"_blank\" >爱玛电动车 小爱蜜</a> 已经被收货啦。',1,'系统通知','2021-03-08 04:35:07',2),('1615179956850611706','1577713712942250291','您已成功购买 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 请随时查看物流信息。',1,'系统通知','2021-03-08 05:05:56',2),('1615179956854925172','1582184795951594874','您的商品 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 被购买了，请及时发货。',1,'系统通知','2021-03-08 05:05:56',2),('1615180008662850682','1589628308220845788','您购买的 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 已经发货， 请注意查看物流信息。',1,'系统通知','2021-03-08 05:06:48',2),('1615180025853175908','1589628308220845788','您售出的商品 <a href=/product-detail/1583937436355876950 style=\"color:#08bf91\" target=\"_blank\" >活着</a> 已经被收货啦。',1,'系统通知','2021-03-08 05:07:05',2),('1615180892435706850','1589628308220845788','您已成功购买 <a href=/product-detail/1583935211397204485 style=\"color:#08bf91\" target=\"_blank\" >基于Python的大数据分析基础及实战</a> 请随时查看物流信息。',1,'系统通知','2021-03-08 05:21:32',2),('1615180892437792395','1589628308220845788','您的商品 <a href=/product-detail/1583935211397204485 style=\"color:#08bf91\" target=\"_blank\" >基于Python的大数据分析基础及实战</a> 被购买了，请及时发货。',1,'系统通知','2021-03-08 05:21:32',2),('1684658506112855918','1589628308220845788','您的商品 <a href=/product-detail/1684658505494770071 style=\"color:#08bf91\" target=\"_blank\" >1</a> 进入待审核队列，请您耐心等待。',0,'商品审核',NULL,1);
/*!40000 ALTER TABLE `notices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reply`
--

DROP TABLE IF EXISTS `reply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reply` (
  `rid` varchar(64) NOT NULL COMMENT '回复id',
  `cid` varchar(64) NOT NULL COMMENT '评论id',
  `commid` varchar(64) NOT NULL COMMENT '商品id',
  `cuserid` varchar(64) NOT NULL COMMENT '被回复用户id',
  `spuserid` varchar(64) DEFAULT NULL COMMENT '商品发布者id',
  `recontent` varchar(255) DEFAULT NULL COMMENT '回复内容',
  `ruserid` varchar(64) NOT NULL COMMENT '回复者id',
  `replytime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '回复时间',
  `repstatus` int DEFAULT '1' COMMENT '0异常 1正常 2删除',
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reply`
--

LOCK TABLES `reply` WRITE;
/*!40000 ALTER TABLE `reply` DISABLE KEYS */;
INSERT INTO `reply` VALUES ('1','1','1577792919764240135','1582184795951594874','1577713712942250291','嗯呢','1577713712942250291','2020-02-24 14:54:11',1),('1588262384743447563','1588251204811301252','1583939483587193411','1577713712942250291','1582184795951594874','可以呀，我这车子很新的','1582184795951594874','2020-04-30 15:59:44',1),('1614226529645282498','1614226508675446955','1583940546885846474','1577713712942250291','1582184795951594874','222','1582184795951594874','2021-02-25 04:15:29',1);
/*!40000 ALTER TABLE `reply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `report`
--

DROP TABLE IF EXISTS `report`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `report` (
  `id` varchar(64) NOT NULL,
  `type` varchar(10) NOT NULL,
  `reported_id` varchar(64) NOT NULL,
  `reporter_id` varchar(64) NOT NULL,
  `reason` text NOT NULL,
  `report_time` datetime NOT NULL,
  `status` int DEFAULT '0' COMMENT '举报状态，0 表示未处理，1 表示已处理',
  `appeal_content` text COMMENT '申诉内容',
  `appeal_status` int DEFAULT '0' COMMENT '申诉状态，0 表示未申诉，1 表示已申诉',
  `appeal_result` int DEFAULT '0' COMMENT '     * 申诉结果，0 表示未处理，1 表示已处理，2 表示申诉无效 ',
  PRIMARY KEY (`id`),
  KEY `reported_id` (`reported_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `report`
--

LOCK TABLES `report` WRITE;
/*!40000 ALTER TABLE `report` DISABLE KEYS */;
INSERT INTO `report` VALUES ('1660150234883362817','article','A001','admin','1','2023-05-21 13:07:15',0,NULL,0,0);
/*!40000 ALTER TABLE `report` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `soldrecord`
--

DROP TABLE IF EXISTS `soldrecord`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `soldrecord` (
  `id` varchar(64) NOT NULL COMMENT '售出记录id',
  `commid` varchar(64) NOT NULL COMMENT '商品id',
  `commname` varchar(255) DEFAULT NULL COMMENT '商品名',
  `commdesc` varchar(255) DEFAULT NULL COMMENT '商品描述',
  `thinkmoney` decimal(55,2) DEFAULT NULL COMMENT '售价',
  `soldtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '售出时间',
  `userid` varchar(64) NOT NULL COMMENT '用户id',
  `soldstatus` int DEFAULT '1' COMMENT '1正常 2删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `soldrecord`
--

LOCK TABLES `soldrecord` WRITE;
/*!40000 ALTER TABLE `soldrecord` DISABLE KEYS */;
INSERT INTO `soldrecord` VALUES ('1586773115334362712','1583937754237685707','湘鑫宏日式垃圾桶','湘鑫宏日式垃圾桶北欧家用垃圾篓大号厕所时尚筒带盖小卫生间创意简约干湿分类压圈垃圾桶 日系白色印花小鹿',10.00,'2020-04-13 10:18:35','1582184795951594874',1),('1586773281001490360','1583938501381902202','南极人2020春季新款男士韩版休闲牛仔外套','南极人2020春季新款男士韩版休闲牛仔外套潮流秋冬装ins港仔文艺夹克上衣服 605白黑【单件】 XL/120-135斤',85.00,'2020-04-13 10:21:21','1582184795951594874',1),('1587889176015334502','1583940546885846474','爱玛电动车 小爱蜜','爱玛电动车 小爱蜜 电动自行车学生代步电瓶车 前后真空胎 带脚踏 加长舒适后减震 3C大证 新国标 奶白咖啡 新国标',1200.00,'2020-04-26 08:19:36','1582184795951594874',1);
/*!40000 ALTER TABLE `soldrecord` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sys_job`
--

DROP TABLE IF EXISTS `sys_job`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sys_job` (
  `id` varchar(50) NOT NULL COMMENT '任务id',
  `bean_name` varchar(200) DEFAULT NULL COMMENT 'spring bean名称',
  `params` varchar(2000) DEFAULT NULL COMMENT '参数',
  `cron_expression` varchar(100) DEFAULT NULL COMMENT 'cron表达式',
  `status` tinyint DEFAULT NULL COMMENT '任务状态  0：正常  1：暂停',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='定时任务';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sys_job`
--

LOCK TABLES `sys_job` WRITE;
/*!40000 ALTER TABLE `sys_job` DISABLE KEYS */;
INSERT INTO `sys_job` VALUES ('1252884495040782337','testTask','1','0 */1 * * * ?',1,'1','2020-04-22 16:58:35');
/*!40000 ALTER TABLE `sys_job` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sys_job_log`
--

DROP TABLE IF EXISTS `sys_job_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sys_job_log` (
  `id` varchar(50) NOT NULL COMMENT '任务日志id',
  `job_id` varchar(50) NOT NULL COMMENT '任务id',
  `bean_name` varchar(200) DEFAULT NULL COMMENT 'spring bean名称',
  `params` varchar(2000) DEFAULT NULL COMMENT '参数',
  `status` tinyint NOT NULL COMMENT '任务状态    0：成功    1：失败',
  `error` varchar(2000) DEFAULT NULL COMMENT '失败信息',
  `times` int NOT NULL COMMENT '耗时(单位：毫秒)',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `job_id` (`job_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='定时任务日志';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sys_job_log`
--

LOCK TABLES `sys_job_log` WRITE;
/*!40000 ALTER TABLE `sys_job_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `sys_job_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_info`
--

DROP TABLE IF EXISTS `user_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_info` (
  `userid` varchar(64) NOT NULL COMMENT '用户id',
  `username` varchar(255) NOT NULL COMMENT '用户昵称',
  `password` varchar(255) NOT NULL COMMENT '用户密码',
  `mobilephone` varchar(255) DEFAULT NULL COMMENT '手机号',
  `email` varchar(255) DEFAULT NULL COMMENT '用户邮箱',
  `uimage` varchar(255) DEFAULT NULL COMMENT '用户头像',
  `sex` varchar(255) DEFAULT NULL COMMENT '用户性别',
  `school` varchar(255) DEFAULT NULL COMMENT '学校',
  `faculty` varchar(255) DEFAULT NULL COMMENT '院系',
  `startime` varchar(4) DEFAULT NULL COMMENT '入学时间',
  `userstatus` int DEFAULT '1' COMMENT '1正常 0封号',
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '注册时间',
  `status` varchar(255) DEFAULT 'offline' COMMENT '账户状态(1.正常 0.锁定 )',
  `sign` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_info`
--

LOCK TABLES `user_info` WRITE;
/*!40000 ALTER TABLE `user_info` DISABLE KEYS */;
INSERT INTO `user_info` VALUES ('1577713712942250291','小雨点','1cd75ca00db28072479992f87d4a647e','15239670411','123456781@qq.com','/images/pic/xz_1582081544527.png','男','清华大学','软件学院','2017',1,'2019-12-30 13:53:26','online','如此清秋何吝酒，这般明月不须钱'),('1582184795951594874','小囧姐','1cd75ca00db28072479992f87d4a647e','15239670412','123456782@qq.com','/images/pic/2d885a22918841c99c685379f0f4ce41.jpg','男','清华大学','软件学院','2017',1,'2020-02-20 07:46:35','offline','如此清秋何吝酒，这般明月不须钱'),('1587889073148226284','鱼与飞鸟','1cd75ca00db28072479992f87d4a647e','123456783','123456783@qq.com','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','女','北京大学','音乐学院','2016',1,'2020-04-26 08:17:53','offline','如此清秋何吝酒，这般明月不须钱'),('1589627579283677652','木子','1cd75ca00db28072479992f87d4a647e','123456784','123456784@qq.com','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','女','北京大学','美术学院','2016',1,'2020-05-16 11:12:59','offline','如此清秋何吝酒，这般明月不须钱'),('1589628308220845788','紫殇~','1cd75ca00db28072479992f87d4a647e','admin','123456785@qq.com','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','女','北京大学','美术学院','2016',1,'2020-05-16 11:28:05','online','如此清秋何吝酒，这般明月不须钱'),('1589644044287166342','a','1cd75ca00db28072479992f87d4a647e','123456785','123456786@qq.com','/images/pic/0bbe6324950541daa751fa50f89e9cff.png','女','北京大学','贸易经济学院','2019',1,'2020-05-16 15:47:24','offline','如此清秋何吝酒，这般明月不须钱'),('1589680953404254146','种鱼的猫猫','1cd75ca00db28072479992f87d4a647e','15239670413','123456787@qq.com','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','女','首都医科大学','护理学院','2019',1,'2020-05-17 02:02:33','offline','如此清秋何吝酒，这般明月不须钱'),('1589694955949934523','那些年','1cd75ca00db28072479992f87d4a647e','15239670414','123456788@qq.com','/images/pic/d1d66c3ea71044a9b938b00859ca94df.jpg','男','清华大学','计算机','2020',1,'2020-05-17 05:55:55','offline','如此清秋何吝酒，这般明月不须钱');
/*!40000 ALTER TABLE `user_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_perm`
--

DROP TABLE IF EXISTS `user_perm`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_perm` (
  `roleid` int DEFAULT NULL COMMENT '1普通用户 2管理员 3超级管理员',
  `perms` varchar(255) DEFAULT NULL COMMENT '对应权限',
  `mean` varchar(255) DEFAULT NULL COMMENT '权限解释'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_perm`
--

LOCK TABLES `user_perm` WRITE;
/*!40000 ALTER TABLE `user_perm` DISABLE KEYS */;
INSERT INTO `user_perm` VALUES (1,'user:userinfo','用户个人信息'),(3,'admin:set','设置管理员'),(2,'user:userinfo','用户个人信息'),(3,'user:userinfo','用户个人信息');
/*!40000 ALTER TABLE `user_perm` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_role`
--

DROP TABLE IF EXISTS `user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_role` (
  `userid` varchar(64) NOT NULL COMMENT '用户id',
  `roleid` int NOT NULL DEFAULT '1' COMMENT '1普通用户 2管理员 3超级管理员',
  `identity` varchar(255) DEFAULT NULL COMMENT '身份',
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_role`
--

LOCK TABLES `user_role` WRITE;
/*!40000 ALTER TABLE `user_role` DISABLE KEYS */;
INSERT INTO `user_role` VALUES ('1577713712942250291',2,'管理员'),('1582184795951594874',2,'管理员'),('1587889073148226284',1,'网站用户'),('1589627579283677652',1,'网站用户'),('1589628308220845788',3,'超级管理员'),('1589644044287166342',1,'网站用户'),('1589680953404254146',1,'网站用户'),('1589694955949934523',1,'网站用户');
/*!40000 ALTER TABLE `user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-05-21 22:26:52
